-------------------------------------------------------------------

# Aplicando Junções em SQL

-------------------------------------------------------------------

In [42]:
!pip install -q ipython-sql

In [1]:
import sqlite3
import pandas as pd

-------------------------------------------------------------------

## Criando tabelas e inserindo dados dentro do  banco de dados

*    TB_CLIENTES-dados dos clientes(nome_cliente, endereco_cliente, cidade_cliente, estado_cliente)

*    TB_PEDIDOS-dados dos pedidos(id_pedido, id_cliente, id_vendedor, data_pedido, produto, id_entrega)

*    TB_VENDEDOR-dados dos vendedores(id_vendedor, nome_vendedor)

#### O banco de dados  é preenchido com dados ficticios de vendas de uma Livraria.

In [2]:
cnn= sqlite3.connect('D:/SQL/livraria.db1.0')
cursor=cnn.cursor()

cursor.execute('''
    CREATE TABLE IF NOT EXISTS TB_CLIENTES (
        id_cliente INTEGER PRIMARY KEY AUTOINCREMENT,
        nome_cliente TEXT,
        endereco_cliente TEXT,
        cidade_cliente TEXT,
        estado_cliente TEXT
    );
''')


cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Maria Lurdes", "Rua 62", "Fortaleza", "CE"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Ronaldo Lima", "Rua 12", "Campinas", "SP"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Frank Dill", "Rua Principal", "Rio de Janeiro", "RJ"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Guilherme Sousa", "Rua 1", "Campos", "RJ"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Lady Jhow", "Rua 99", "Porto Alegre", "RS"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Caio Dimas", "Rua L", "Porto Alegre", "RS"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Joao Pedro", "Rua 2", "Itacare", "BA"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Guilherme F", "SQS 202", "Brasilia", "DF"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Gabriel F", "SQS 212", "Brasilia", "DF"))

cursor.execute("INSERT INTO TB_CLIENTES (nome_cliente, endereco_cliente, cidade_cliente, estado_cliente) VALUES(?, ?, ?, ?)",
               ("Alceu", "Quadra 2", "Ceilandia", "DF"))

cursor.execute('''
    CREATE TABLE IF NOT EXISTS TB_PEDIDOS (
        id_pedido INTEGER PRIMARY KEY,
        id_cliente INTEGER NULL,
        id_vendedor INTEGER NULL,
        data_pedido DATETIME NULL,
        produto TEXT NULL,
        id_entrega INTEGER NULL
    )
''')

from datetime import datetime
now = datetime.now().strftime('%Y-%m-%d %H:%M:%S')

cursor.execute("INSERT INTO TB_PEDIDOS (id_pedido, id_cliente, id_vendedor, data_pedido, produto, id_entrega) VALUES(?, ?, ?, ?, ?, ?)",
               (1001, 1, 5, now, 'livro', 23))

cursor.execute("INSERT INTO TB_PEDIDOS (id_pedido, id_cliente, id_vendedor, data_pedido, produto, id_entrega) VALUES(?, ?, ?, ?, ?, ?)",
               (1002, 1, 7, now, 'jogo', 24))

cursor.execute("INSERT INTO TB_PEDIDOS (id_pedido, id_cliente, id_vendedor, data_pedido, produto, id_entrega) VALUES(?, ?, ?, ?, ?, ?)",
               (1003, 2, 5, now, 'livro', 23))

cursor.execute("INSERT INTO TB_PEDIDOS (id_pedido, id_cliente, id_vendedor, data_pedido, produto, id_entrega) VALUES(?, ?, ?, ?, ?, ?)",
               (1004, 4, 3, now, 'vale', 25))

cursor.execute("INSERT INTO TB_PEDIDOS (id_pedido, id_cliente, id_vendedor, data_pedido, produto, id_entrega) VALUES(?, ?, ?, ?, ?, ?)",
               (1005, 9, 5, now, 'livro', 26))

cursor.execute('''
    CREATE TABLE IF NOT EXISTS TB_VENDEDOR (
        id_vendedor INTEGER PRIMARY KEY,
        nome_vendedor TEXT NULL
    );
''')


cursor.execute("INSERT INTO TB_VENDEDOR (id_vendedor, nome_vendedor) VALUES (?, ?)",
               (1, 'Rafael'))

cursor.execute("INSERT INTO TB_VENDEDOR (id_vendedor, nome_vendedor) VALUES (?, ?)",
               (2, 'Carlos'))

cursor.execute("INSERT INTO TB_VENDEDOR (id_vendedor, nome_vendedor) VALUES (?, ?)",
               (3, 'Chico'))

cursor.execute("INSERT INTO TB_VENDEDOR (id_vendedor, nome_vendedor) VALUES (?, ?)",
               (4, 'Fabiana'))

cursor.execute("INSERT INTO TB_VENDEDOR (id_vendedor, nome_vendedor) VALUES (?, ?)",
               (5, 'Luiza'))

cursor.execute("INSERT INTO TB_VENDEDOR (id_vendedor, nome_vendedor) VALUES (?, ?)",
               (6, 'Breno'))

cursor.execute("INSERT INTO TB_VENDEDOR (id_vendedor, nome_vendedor) VALUES (?, ?)",
               (7, 'Vinicius'))

# Realizar o commit das alterações
cnn.commit ()
cnn.close ()

In [3]:
%load_ext sql
%sql sqlite:///D:/SQL/livraria.db1.0

#### Tabela Clientes

In [26]:
%%sql
SELECT * FROM TB_CLIENTES

 * sqlite:///D:/SQL/livraria.db1.0
Done.

[(1, 'Maria Lurdes', 'Rua 62', 'Fortaleza', 'CE'),
 (2, 'Ronaldo Lima', 'Rua 12', 'Campinas', 'SP'),
 (3, 'Frank Dill', 'Rua Principal', 'Rio de Janeiro', 'RJ'),
 (4, 'Guilherme Sousa', 'Rua 1', 'Campos', 'RJ'),
 (5, 'Lady Jhow', 'Rua 99', 'Porto Alegre', 'RS'),
 (6, 'Caio Dimas', 'Rua L', 'Porto Alegre', 'RS'),
 (7, 'Joao Pedro', 'Rua 2', 'Itacare', 'BA'),
 (8, 'Guilherme F', 'SQS 202', 'Brasilia', 'DF'),
 (9, 'Gabriel F', 'SQS 212', 'Brasilia', 'DF'),
 (10, 'Alceu', 'Quadra 2', 'Ceilandia', 'DF')]

#### Tabela Pedidos

In [27]:
%%sql
SELECT * FROM TB_PEDIDOS

 * sqlite:///D:/SQL/livraria.db1.0
Done.

[(1001, 1, 5, '2023-11-27 19:40:57', 'livro', 23),
 (1002, 1, 7, '2023-11-27 19:40:57', 'jogo', 24),
 (1003, 2, 5, '2023-11-27 19:40:57', 'livro', 23),
 (1004, 4, 3, '2023-11-27 19:40:57', 'vale', 25),
 (1005, 9, 5, '2023-11-27 19:40:57', 'livro', 26)]

#### Tabela Vendedores

In [28]:
%%sql
SELECT * FROM TB_VENDEDOR

 * sqlite:///D:/SQL/livraria.db1.0
Done.

[(1, 'Rafael'),
 (2, 'Carlos'),
 (3, 'Chico'),
 (4, 'Fabiana'),
 (5, 'Luiza'),
 (6, 'Breno'),
 (7, 'Vinicius')]

# INNER JOIN

*   A cláusula INNER JOIN retorna apenas os registros que têm correspondências em ambas as tabelas.

In [29]:
cnn= sqlite3.connect('D:/SQL/livraria.db1.0')
cursor = cnn.cursor()

#objetivo: Trazer os clientes quando tiver um pedido associado

query_0=('''
    SELECT C.nome_cliente, P.id_pedido,P.id_entrega
    FROM TB_CLIENTES as C
    JOIN TB_PEDIDOS AS P ON C.id_cliente = P.id_cliente
''')

# Obter os resultados
df = pd.read_sql_query(query_0, cnn)
print(df)

      nome_cliente  id_pedido  id_entrega
0     Maria Lurdes       1001          23
1     Maria Lurdes       1002          24
2     Ronaldo Lima       1003          23
3  Guilherme Sousa       1004          25
4        Gabriel F       1005          26

In [30]:
# Inner Join com 3 tabelas
# Objetivo : Trazer o id_pedido junto com o nome do cliente  e o vendedor responsavel

query_1=('''
    SELECT P.id_pedido, C.nome_cliente, V.nome_vendedor
FROM ((TB_PEDIDOS AS P
INNER JOIN TB_CLIENTES AS C ON P.id_cliente = C.id_cliente)
INNER JOIN TB_VENDEDOR AS V ON P.id_vendedor = V.id_vendedor);

''')

# Obter os resultados
df = pd.read_sql_query(query_1, cnn)
print(df)

   id_pedido     nome_cliente nome_vendedor
0       1001     Maria Lurdes         Luiza
1       1002     Maria Lurdes      Vinicius
2       1003     Ronaldo Lima         Luiza
3       1004  Guilherme Sousa         Chico
4       1005        Gabriel F         Luiza

In [32]:
#objetivo : Traz todas as cidades quando se tiver um produto associado

query_2=('''
    SELECT C.cidade_cliente, P.produto
    FROM TB_CLIENTES as C
    JOIN TB_PEDIDOS AS P ON C.id_cliente = P.id_cliente
''')


# Obter os resultados
df = pd.read_sql_query(query_2, cnn)
print(df)

  cidade_cliente produto
0      Fortaleza   livro
1      Fortaleza    jogo
2       Campinas   livro
3         Campos    vale
4       Brasilia   livro

# LEFT JOIN

*  Left Join - indica que queremos todos os dados da tabela da esquerda mesmo sem correspondente na tabela da direita

In [33]:


#objetivo : Traz todos os clientes cadastrados  mesmo se não tiver um pedido associado ao cliente  ,por meio do left Join.


query_3=('''
    
SELECT C.nome_cliente,CASE WHEN P.id_pedido IS NOT NULL THEN P.id_pedido
            ELSE 'Sem pedido' 
       END AS id_ped
FROM TB_CLIENTES AS C
LEFT JOIN TB_PEDIDOS AS P 
ON C.id_cliente = P.id_cliente;


''')

# Obter os resultados
df = pd.read_sql_query(query_3, cnn)
print(df)

       nome_cliente      id_ped
0      Maria Lurdes        1001
1      Maria Lurdes        1002
2      Ronaldo Lima        1003
3        Frank Dill  Sem pedido
4   Guilherme Sousa        1004
5         Lady Jhow  Sem pedido
6        Caio Dimas  Sem pedido
7        Joao Pedro  Sem pedido
8       Guilherme F  Sem pedido
9         Gabriel F        1005
10            Alceu  Sem pedido

In [34]:
#trazer todos os clientes mesmo se nao tiver pedido associado,após isso filtrar o nome 'guilherme' e ordenar por ordem ASCENDENTE
query_4=('''
    
SELECT C.nome_cliente,CASE WHEN P.id_pedido IS NOT NULL THEN P.id_pedido
            ELSE 'Sem pedido' 
       END AS id_ped
FROM TB_CLIENTES AS C
LEFT JOIN TB_PEDIDOS AS P
ON C.id_cliente = P.id_cliente
WHERE C.nome_cliente LIKE 'Guilherme %'
ORDER BY P.id_pedido ASC ;
''')

df = pd.read_sql_query(query_4, cnn)
print(df)

      nome_cliente      id_ped
0      Guilherme F  Sem pedido
1  Guilherme Sousa        1004

# RIGHT J0IN

- Right Join - indica que queremos todos os dados da tabela da direita mesmo sem correspondente na tabela da esquerda

In [35]:


#Objetivo trazer todos os clientes com / sem  pedido associado e a respectiva data da compra

query_5 = '''
SELECT C.nome_cliente,
       CASE WHEN P.data_pedido IS NOT NULL THEN P.data_pedido
            ELSE 'Sem pedido' 
       END AS data_pedido
FROM TB_PEDIDOS AS P
RIGHT JOIN TB_CLIENTES AS C
ON P.id_cliente = C.id_cliente;
'''

# Obter os resultados
df = pd.read_sql_query(query_5, cnn)
print(df)

       nome_cliente          data_pedido
0      Maria Lurdes  2023-11-27 19:40:57
1      Maria Lurdes  2023-11-27 19:40:57
2      Ronaldo Lima  2023-11-27 19:40:57
3   Guilherme Sousa  2023-11-27 19:40:57
4         Gabriel F  2023-11-27 19:40:57
5        Frank Dill           Sem pedido
6         Lady Jhow           Sem pedido
7        Caio Dimas           Sem pedido
8        Joao Pedro           Sem pedido
9       Guilherme F           Sem pedido
10            Alceu           Sem pedido

In [36]:
#Objetivo: retorna a data do pedido,o nome do cliente todos os vendedores, com ou sem pedido associado.

query_6=('''

SELECT CASE WHEN P.data_pedido IS NOT  NULL THEN P.data_pedido
ELSE "sem pedido"
END AS 'data_ped',
 C.nome_cliente, V.nome_vendedor
FROM (( TB_PEDIDOS AS P
JOIN TB_CLIENTES AS C ON P.id_cliente = C.id_cliente)
RIGHT JOIN TB_VENDEDOR AS V ON P.id_vendedor = V.id_vendedor)
ORDER BY C.nome_cliente;


''')

# Obter os resultados
df = pd.read_sql_query(query_6, cnn)
print(df)

              data_ped     nome_cliente nome_vendedor
0           sem pedido             None        Rafael
1           sem pedido             None        Carlos
2           sem pedido             None       Fabiana
3           sem pedido             None         Breno
4  2023-11-27 19:40:57        Gabriel F         Luiza
5  2023-11-27 19:40:57  Guilherme Sousa         Chico
6  2023-11-27 19:40:57     Maria Lurdes         Luiza
7  2023-11-27 19:40:57     Maria Lurdes      Vinicius
8  2023-11-27 19:40:57     Ronaldo Lima         Luiza

# UNION

   * A função UNION em SQL é usada para combinar os resultados de duas ou mais consultas em uma única lista de resultados

In [37]:
#Ele traz a uniao de right e um left na mesma querie
#retorna a clausula do left e a clausula do right em uma unica querie
query_7=('''


SELECT C.nome_cliente, CASE WHEN P.id_pedido IS NOT NULL THEN P.id_pedido
            ELSE 'Sem pedido' 
       END AS id_ped
FROM TB_CLIENTES as C 
LEFT OUTER JOIN TB_PEDIDOS AS P 
ON C.id_cliente = P.id_cliente
UNION
SELECT C.nome_cliente, P.id_pedido
FROM TB_CLIENTES as C 
RIGHT OUTER JOIN TB_PEDIDOS AS P 
ON C.id_cliente = P.id_cliente;



''')

# Obter os resultados
df = pd.read_sql_query(query_7, cnn)
print(df)

       nome_cliente      id_ped
0             Alceu  Sem pedido
1        Caio Dimas  Sem pedido
2        Frank Dill  Sem pedido
3         Gabriel F        1005
4       Guilherme F  Sem pedido
5   Guilherme Sousa        1004
6        Joao Pedro  Sem pedido
7         Lady Jhow  Sem pedido
8      Maria Lurdes        1001
9      Maria Lurdes        1002
10     Ronaldo Lima        1003

# SELF JOIN


*  SELF JOIN  é um tipo de junção em SQL onde uma tabela é combinada com ela mesma

In [38]:
#Utilizando a recursividade(auto-junção)
#Objetivo :descobrir cidades iguais de clientes diferentes
query_8 = '''
SELECT   A.nome_cliente, A.cidade_cliente
FROM TB_CLIENTES A, TB_CLIENTES B
WHERE A.id_cliente <> B.id_cliente
AND A.cidade_cliente = B.cidade_cliente;
'''

df = pd.read_sql_query(query_8, cnn)
print(df)

  nome_cliente cidade_cliente
0    Lady Jhow   Porto Alegre
1   Caio Dimas   Porto Alegre
2  Guilherme F       Brasilia
3    Gabriel F       Brasilia

# CROSS JOIN

 *  Cláusula CROSS JOIN em SQL retorna todas as combinações de linhas da primeira tabela com todas as linhas da segunda tabela.
*  -Util para se filtrar grandes bancos de dados ao inves de utilizar o filtro 'where'

In [39]:
#CROSS JOIN não é uma clausula relacional
query_9=('''SELECT C.nome_cliente, P.id_pedido
FROM TB_CLIENTES AS C
CROSS JOIN TB_PEDIDOS AS P
LIMIT 15;
''')

df = pd.read_sql_query(query_9, cnn)
print(df)

    nome_cliente  id_pedido
0   Maria Lurdes       1001
1   Maria Lurdes       1002
2   Maria Lurdes       1003
3   Maria Lurdes       1004
4   Maria Lurdes       1005
5   Ronaldo Lima       1001
6   Ronaldo Lima       1002
7   Ronaldo Lima       1003
8   Ronaldo Lima       1004
9   Ronaldo Lima       1005
10    Frank Dill       1001
11    Frank Dill       1002
12    Frank Dill       1003
13    Frank Dill       1004
14    Frank Dill       1005

In [40]:
#utilizando o where ele organiza 

#CROSS JOIN
query_10=('''
SELECT C.nome_cliente, P.id_pedido
FROM TB_CLIENTES AS C
CROSS JOIN TB_PEDIDOS AS P
WHERE C.id_cliente = P.id_cliente

''')

df = pd.read_sql_query(query_10, cnn)
print(df)

      nome_cliente  id_pedido
0     Maria Lurdes       1001
1     Maria Lurdes       1002
2     Ronaldo Lima       1003
3  Guilherme Sousa       1004
4        Gabriel F       1005